Failed Banks Data

In [26]:
import pandas as pd
import numpy as np

In [27]:
df = pd.read_csv('banklist.csv',encoding='windows-1252')
df

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
0,First National Bank of Lindsay,Lindsay,OK,4134,First Bank & Trust Co.,18-Oct-24,10547
1,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association",26-Apr-24,10546
2,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,3-Nov-23,10545
3,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.",28-Jul-23,10544
4,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.",1-May-23,10543
...,...,...,...,...,...,...,...
565,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
566,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,4648
567,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,4647
568,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
569,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

In [28]:
df.isna().sum()#to check if there is any missing value

Bank Name                 0
City                      0
State                     0
Cert                      0
Acquiring Institution     0
Closing Date              0
Fund                      0
dtype: int64

In [29]:
df.head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
0,First National Bank of Lindsay,Lindsay,OK,4134,First Bank & Trust Co.,18-Oct-24,10547
1,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association",26-Apr-24,10546
2,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,3-Nov-23,10545
3,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.",28-Jul-23,10544
4,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.",1-May-23,10543

In [30]:
df.tail()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
565,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
566,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,4648
567,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,4647
568,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
569,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

In [31]:
df.count()

Bank Name                 570
City                      570
State                     570
Cert                      570
Acquiring Institution     570
Closing Date              570
Fund                      570
dtype: int64

In [32]:
df.loc[1] #index 1

Bank Name                 Republic First Bank dba Republic Bank
City                                               Philadelphia
State                                                        PA
Cert                                                      27332
Acquiring Institution         Fulton Bank, National Association
Closing Date                                          26-Apr-24
Fund                                                      10546
Name: 1, dtype: object

In [39]:
data =np.array(df)#turned into ndarray

In [40]:
data

array([['First National Bank of Lindsay', 'Lindsay', 'OK', ...,
        'First Bank & Trust Co.', '18-Oct-24', 10547],
       ['Republic First Bank dba Republic Bank', 'Philadelphia', 'PA',
        ..., 'Fulton Bank, National Association', '26-Apr-24', 10546],
       ['Citizens Bank', 'Sac City', 'IA', ...,
        'Iowa Trust & Savings Bank', '3-Nov-23', 10545],
       ...,
       ['First Alliance Bank & Trust Co.', 'Manchester', 'NH', ...,
        'Southern New Hampshire Bank & Trust', '2-Feb-01', 4647],
       ['National State Bank of Metropolis', 'Metropolis', 'IL', ...,
        'Banterra Bank of Marion', '14-Dec-00', 4646],
       ['Bank of Honolulu', 'Honolulu', 'HI', ..., 'Bank of the Orient',
        '13-Oct-00', 4645]], dtype=object)

In [50]:
data[0]

array(['First National Bank of Lindsay', 'Lindsay', 'OK', 4134,
       'First Bank & Trust Co.', '18-Oct-24', 10547], dtype=object)

In [43]:
data[1][0]#first column of second row

'Republic First Bank dba Republic Bank'

In [46]:
data.shape#has 570 rows and 7 columns

(570, 7)